<?php


return [
    'breadcrumb' => [
        'home' => 'صفحه آغازین',
    ],
    'status' => //1->Active/Approved, 2->Inactive, 3->Draft, 4->Archive
        [
            'active' => 'فعال',
            'inactive' => 'غیرفعال',
            'draft' => 'پیش نویس',
            'archive' => 'آرشیو',
            'soft_deleted' => 'حذف موقت',
        ],
    'boolean' => [
        'true' => 'بله',
        'false' => 'خیر',
    ],
    'confirm' => [
        'active' => 'فعال',
        'inactive' => 'غیرفعال',
    ],
    'options' => [
        'status' => [1 => 'فعال', 2 => 'غیرفعال', 3 => 'پیش نویس', 4 => 'آرشیو'],
        'confirm' => [1 => 'بله', 2 => 'خیر'],
        'boolean' => [1 => 'بله', 0 => 'خیر'],
        'priority' => [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
    ],

    'toolbar' => [
        'new' => 'جدید',
        'actions' => 'دیگر اقدامات',
        'search' => 'جستجــو',
        'clearFilters' => 'حذف فیلترهای جستجــو',
        'deleteRecords' => 'حذف رکوردهای انتخابی',
    ],
    'button' => [
        'new' => 'ایجاد رکورد جدید',
        'save' => 'ثبت اطلاعات ',
        'update' => 'بروزرسانی اطلاعات',
        'delete' => 'حذف رکورد',
        'submit' => 'تایید',
        'search' => 'جستجــوی اطلاعات',
        'cancel' => 'لغو عملیات',
        'close' => 'بستن پنجره',
        'back' => 'برگشت به لیست',
        'next' => 'بعدی',
        'previous' => 'قبلی',
        'print' => 'نسخه چاپی',
    ],
    'message' => [
        'succeed' => 'عملیات با موفقیت انجام گردید.',
        'created' => 'ثبت اطلاعات با موفقیت انجام گردید.',
        'updated' => 'بروزرسانی اطلاعات با موفقیت انجام گردید.',
        'deleted' => 'حذف اطلاعات با موفقیت انجام گردید.',
        'changed' => 'اطلاعات با موفقیت تغییر یافت.',
        'restored' => 'اطلاعات با موفقیت بازگردانی گردید.',
        'failed' => 'انجام عملیات موفقیت آمیز نبود، دوباره تلاش نمایید.',
        'bad_request' => 'صحت اطلاعات درخواستی را بررسی نمایید.',
        'unauthorized' => 'مجاز به مشاهد اطلاعات نمی باشید.',
        'forbidden' => 'مجاز به مشاهد اطلاعات نمی باشید.',
        'not_found' => 'اطلاعات مورد نظر یافت نگردید.',
        'accepted' => 'عملیات با موفقیت انجام گردید.',
        'no_data' => 'اطلاعاتی برای نمایش یافت نشد.',
    ],
    'loader' => [
        'loader_slogan' => 'سامانه جامع سلامت و درمان کشور',
        'loader_title' => 'پــزشــک بوک',
        'loader_title_part1' => 'پــزشــک',
        'loader_title_part2' => 'بوک',
        'loader_title_part3' => 'در حال بارگذاری ...',
    ],
    'errors' => [
        '401' => 'دسترسی غیرمجاز', //The 401 Unauthorized error
        '403' => 'دسترسی نادرست', //The 403 Forbidden error
        '404' => 'صفحه مورد نظر یافت نشد', //The 404 Not Found
        '405' => 'متد غیرمجاز', //The 405 Method Not Allowed
        '500' => 'بروز خطای داخلی', //500 Internal Server Error
        '503' => 'سرویس خارج از دسترسی', //The 503 Service Unavailable
    ],
    'labels' => [
        'page' => 'صفحه',
    ],
    'img_alts' => [
        'logo' => 'پینار خودرو',
    ],
    'actions' => [
        'datatable' => 'لیست اطلاعات',
        'index' => 'لیست اطلاعات',
        'create' => 'درج اطلاعات جدید',
        'edit' => 'بروزرسانی اطلاعات',
        'update' => 'اطلاعات بروزرسانی شد',
        'store' => 'ثبت اطلاعات',
        'delete' => 'حذف اطلاعات',
        'show' => 'نمایش اطلاعات',
        'download' => 'دانلود فایل پیوست',
    ],
];
